app/views/projects/show.html.erb

<%# ---------------------------------Bugs %>
<%if @project.bugs.count != 0 %>
  <h2 align="center">Bugs created by QA: </h2>
  <% @project.bugs.each do |bug|%>
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."project_id" = ?  [["project_id", 1]]
SELECT COUNT(*) FROM "bugs" WHERE "bugs"."project_id" = ?  [["project_id", 4]]
SELECT "bugs".* FROM "bugs" WHERE "bugs"."project_id" = ?  [["project_id", 4]]