app/controllers/bugs_controller.rb

  def new
    @bug = Bug.new()
    #  @bug = Bug.find(params[:id])   # projects/1/bugs/new
    @project = Project.find_by(id: params[:project_id])  #projects/1
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @bug = Bug.new(bug_params)
    @bug.creator_id = current_user.id
    @project = Project.find_by(id: params[:project_id]) #projects/1/bugs/new
    @bug.project_id = @project.id
    @developers = @project.users.developer
    if @bug.save
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "bugs" ("title", "description", "deadline", "status", "bug_type", "bug_status", "created_at", "updated_at", "creator_id", "solver_id", "project_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    if can? :edit, @bug
      @bug = Bug.find(params[:id])
      @project = Project.find_by(id: params[:project_id])
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @project = Project.find_by(id: params[:project_id])
    if @bug.update(bug_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bugs" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "bugs"."id" = ?  [["title", "Unit Bug Edited"], ["description", "The buttons in the website are not working properly .The description is updated  "], ["updated_at", "2023-02-06 11:25:02.626319"], ["id", 2]]

  def destroy
    if can? :destroy, @bug
      @bug = Bug.find(params[:id]).destroy
---
DELETE FROM "bugs" WHERE "bugs"."id" = ?  [["id", 2]]
SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def set_bug
    @bug = Bug.find(params[:id])
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]