app/controllers/projects_controller.rb

  def index
    # debugger
    @project=Project.all
---
SELECT "projects".* FROM "projects"

  def create
    #@project =Project.new
    @project = Project.new(project_params)
    #@project = current_user
    #@project = current_user.id
    @project.creator_id = current_user.id
    if @project.save
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?)  [["title", "Test Project"], ["description", "This is description of test project"], ["created_at", "2023-02-05 18:26:09.615867"], ["updated_at", "2023-02-05 18:26:09.615867"], ["creator_id", 1]]